---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.RemapConstrainLocationLine
source: html/dcbf0e58-365a-a3e9-27af-550e0cd29ae7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.RemapConstrainLocationLine Property

Existing locked constraints to the Location Line will be transferred to the new Location Line position. Press "Unconstrain" to remove the constraint rather than transferring it.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemapConstrainLocationLine { get; }
```